meat-plant/ssl/Catalogs/Продукция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Продукция</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сырье</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сырье</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

meat-plant/ssl/InformationRegisters/Цена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Цена</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

meat-plant/ssl/Catalogs/Продукция/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Цена = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите цену";
		Сообщение.Поле = "Цена";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	ТекДата = НачалоДня(ТекущаяДата());          
	
	НаборЗаписей = РегистрыСведений.ЦеныНаТовары.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекДата);
  	НаборЗаписей.Отбор.Товар.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	ЕстьИзменения = Ложь;
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекДата; 
		Запись.Пиццерия = Объект.Пиццерия;
		Запись.Товар = ТекущийОбъект.Ссылка;
		Запись.Цена = Цена;  
		
		ЕстьИзменения = Истина;
	Иначе
		Запись = НаборЗаписей.Получить(0);
		Если Запись.Цена <> Цена Тогда
			ЕстьИзменения = Истина;
			Запись.Цена = Цена;
		КонецЕсли;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦенаСрезПоследних.Сумма, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.Цена.СрезПоследних(, Продукт = &Продукт) КАК ЦенаСрезПоследних";
	
	Запрос.УстановитьПараметр("Продукт", ТекущийОбъект.Ссылка);		
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Цена = Выборка.Цена;
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура СоставКоличествоПриИзменении(Элемент)   
	//Объект.Вес = Объект.Состав.Итог("Количество");
//КонецПроцедуры
